*In this program I implement a calculator for basic arithmetic operations
IDENTIFICATION DIVISION.
PROGRAM-ID. CALCOLATRICE.
AUTHOR. MAX.

PROCEDURE DIVISION.

STOP RUN.
