*>In this program I implement a calculator for basic arithmetic operations
IDENTIFICATION DIVISION.
PROGRAM-ID. CALCOLATRICE.

PROCEDURE DIVISION.

STOP RUN.
