IDENTIFICATION DIVISION.
PROGRAM-ID. RANDOM_NUMBER.
AUTHOR. MAX.

DATA DIVISION.
    WORKING-STORAGE SECTION.
        01 WS-VAL PIC 9(2).
        
PROCEDURE DIVISION.
    COMPUTE WS-VAL = FUNCTION RANDOM * 50.
    DISPLAY "Valore random generato: "WS-VAL.
STOP RUN.


