
IDENTIFICATION DIVISION.
PROGRAM-ID. WEEK.
AUTHOR. MAX.

DATA DIVISION.
	WORKING-STORAGE SECTION.
	01 DAYS-ARR.
		07 DAY1 PIC X(15) VALUE "Sunday".
		07 DAY2 PIC X(15) VALUE "Monday".
		07 DAY3 PIC X(15) VALUE "Tuesday".
		07 DAY4 PIC X(15) VALUE "Wednsday".
		07 DAY5 PIC X(15) VALUE "Thursday".
		07 DAY6 PIC X(15) VALUE "Friday".
		07 DAY7 PIC X(15) VALUE "Saturday".

PROCEDURE DIVISION.

	DISPLAY "Days of week: " DAYS-ARR.
STOP RUN.

