
IDENTIFICATION DIVISION.
PROGRAM-ID. WEEK.
AUTHOR. MAX.

DATA DIVISION.
     WORKING-STORAGE SECTION.
* dichiaro un array (table) e lo riempio di giorni	
     01 WS-WEEK.
		07 WS-DAY OCCURS 7 TIMES INDEXED BY WS-IDX.
		08 WS-NAME PIC X(15).
	   

PROCEDURE DIVISION.
	SET WS-IDX TO 1.
	MOVE "Sunday" TO WS-DAY(WS-IDX).
	
	SET WS-IDX UP BY 1.
	MOVE "Monday" TO WS-DAY(WS-IDX).
	
	SET WS-IDX UP BY 1.
	MOVE "Tuesday" TO WS-DAY(WS-IDX).
	
	SET WS-IDX UP BY 1.
	MOVE "Wednesday" TO WS-DAY(WS-IDX).
	
	SET WS-IDX UP BY 1.
	MOVE "Thursday" TO WS-DAY(WS-IDX).
	
		
	SET WS-IDX UP BY 1.
	MOVE "Friday" TO WS-DAY(WS-IDX).
	
		
	SET WS-IDX UP BY 1.
	MOVE "Saturday" TO WS-DAY(WS-IDX).

	PERFORM VARYING WS-IDX FROM 1 BY 1 UNTIL WS-IDX > 7
		DISPLAY "Day of the week: " WS-DAY(WS-IDX)
	END-PERFORM.
	
STOP RUN.

